Name: Erick Correia Silva 

Date: 08/09/2021

In [51]:
#imports
import pandas as pd
import numpy as np 
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

In [64]:
#instanciando os dados de treino e teste 
train = pd.read_csv("/content/drive/MyDrive/ML atividades /Dadasets/titanic/train.csv")
teste = pd.read_csv("/content/drive/MyDrive/ML atividades /Dadasets/titanic/test.csv")

print(train.shape)
train.head(10)

(891, 12)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [53]:
#informaçoes sobre os dados de treino 
print(train.info())

print("\n ########################################### \n")
#veficando de a dados faltantes
print(train.isna().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

 ###########################################

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [68]:
#informaçoes sobre os dados de teste
print(teste.info())

print("\n ########################################### \n")
#veficando de a dados faltantes
print(teste.isna().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
None

 ###########################################

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [75]:
#tratamendo de dados NaN
train.dropna(inplace=True)
teste.dropna(inplace =True)

print("new shape train", train.shape)
print("\nnew shape test",teste.shape)

new shape train (183, 12)

new shape test (87, 11)

In [55]:
#balaneceamento dos dados

In [54]:
#transformando dados categoricos em numericos

In [76]:
colum = ['PassengerId', 'Pclass', 'Name','Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

X = train[colum] #amostra
y = train['Survived'] #classe

#criando um conjuto de treino e validação 
X_train, X_valid, y_train, y_valid = train_test_split(X, y, test_size = 0.5, random_state = 43)

In [ ]:
#model = RandomForestClassifier(n_estimators= 100, n_jobs= -1, random_state= 43)